[Killed] ConditionalExpression
src/lib/i18n.ts:30:10
  * Retorna true se o valor é um SupportedLocale válido.
  */
 export function isLocale(value: unknown): value is SupportedLocale {
-  return typeof value === 'string' && (SUPPORTED_LOCALES as string[]).includes(value)
+  return true
 }
 
killedBy: i18n isLocale returns false for unsupported locale fr-FR
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/lib/i18n.ts:30:10
  * Retorna true se o valor é um SupportedLocale válido.
  */
 export function isLocale(value: unknown): value is SupportedLocale {
-  return typeof value === 'string' && (SUPPORTED_LOCALES as string[]).includes(value)
+  return false
 }
 
killedBy: i18n isLocale returns true for valid locale pt-BR
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/lib/i18n.ts:44:16
   const locale = process.env.NEXT_PUBLIC_LOCALE
 
   // String vazia equivale a ausente
-  if (!locale) {
-    if (process.env.NODE_ENV === 'production') {
-      throw new Error('[getActiveLocale] NEXT_PUBLIC_LOCALE não definido em produção')
-    }
-    return 'pt-BR' // dev fallback
-  }
+  if (!locale) {}
 
   if (!isLocale(locale)) {
killedBy: i18n getActiveLocale throws in production when NEXT_PUBLIC_LOCALE is not set
statusReason: expected [Function] to throw error including 'NEXT_PUBLIC_LOCALE não definido em pr…' but got '[getActiveLocale] NEXT_PUBLIC_LOCALE …'

[Killed] ConditionalExpression
src/lib/i18n.ts:44:7
   const locale = process.env.NEXT_PUBLIC_LOCALE
 
   // String vazia equivale a ausente
-  if (!locale) {
+  if (false) {
     if (process.env.NODE_ENV === 'production') {
       throw new Error('[getActiveLocale] NEXT_PUBLIC_LOCALE não definido em produção')
killedBy: i18n getActiveLocale throws in production when NEXT_PUBLIC_LOCALE is not set
statusReason: expected [Function] to throw error including 'NEXT_PUBLIC_LOCALE não definido em pr…' but got '[getActiveLocale] NEXT_PUBLIC_LOCALE …'

[Killed] ConditionalExpression
src/lib/i18n.ts:45:9
 
   // String vazia equivale a ausente
   if (!locale) {
-    if (process.env.NODE_ENV === 'production') {
+    if (true) {
       throw new Error('[getActiveLocale] NEXT_PUBLIC_LOCALE não definido em produção')
     }
killedBy: i18n getActiveLocale returns pt-BR in development when NEXT_PUBLIC_LOCALE is not set
statusReason: [getActiveLocale] NEXT_PUBLIC_LOCALE não definido em produção

[Killed] ConditionalExpression
src/lib/i18n.ts:45:9
 
   // String vazia equivale a ausente
   if (!locale) {
-    if (process.env.NODE_ENV === 'production') {
+    if (false) {
       throw new Error('[getActiveLocale] NEXT_PUBLIC_LOCALE não definido em produção')
     }
killedBy: i18n getActiveLocale throws in production when NEXT_PUBLIC_LOCALE is not set
statusReason: expected [Function] to throw an error

[Survived] StringLiteral
src/lib/i18n.ts:53:7
 
   if (!isLocale(locale)) {
     throw new Error(
-      `[getActiveLocale] NEXT_PUBLIC_LOCALE inválido: "${locale}". ` +
+      `` +
       `Locales suportados: ${SUPPORTED_LOCALES.join(', ')}`
     )

[Survived] StringLiteral
src/lib/i18n.ts:54:7
   if (!isLocale(locale)) {
     throw new Error(
       `[getActiveLocale] NEXT_PUBLIC_LOCALE inválido: "${locale}". ` +
-      `Locales suportados: ${SUPPORTED_LOCALES.join(', ')}`
+      ``
     )
   }

[Survived] StringLiteral
src/lib/i18n.ts:54:53
   if (!isLocale(locale)) {
     throw new Error(
       `[getActiveLocale] NEXT_PUBLIC_LOCALE inválido: "${locale}". ` +
-      `Locales suportados: ${SUPPORTED_LOCALES.join(', ')}`
+      `Locales suportados: ${SUPPORTED_LOCALES.join("")}`
     )
   }

[Killed] ConditionalExpression
src/lib/i18n.ts:74:7
   const activeLocale = locale ?? getActiveLocale()
   const config = SITE_CONFIGS[activeLocale]
 
-  if (!config) {
+  if (false) {
     throw new Error(
       `[getSiteConfig] Locale inválido: "${activeLocale}". ` +
killedBy: i18n getSiteConfig throws Error with "Locale inválido" for unsupported locale
statusReason: expected [Function] to throw an error

[Survived] StringLiteral
src/lib/i18n.ts:77:53
   if (!config) {
     throw new Error(
       `[getSiteConfig] Locale inválido: "${activeLocale}". ` +
-      `Locales suportados: ${SUPPORTED_LOCALES.join(', ')}`
+      `Locales suportados: ${SUPPORTED_LOCALES.join("")}`
     )
   }
